/* ========================================================
                        国家图片配置
======================================================== */
export const sandwichImgs = [{
  wich_name: '玉米三明治',
  desc: '1、将面包片均匀涂抹少量丘比沙拉酱香甜味，蔬菜洗净沥干，西红柿切圆形薄片备用。 \n2、金枪鱼开罐、沥干、拌入丘比沙拉酱香甜味，做成金枪鱼酱备用。 \n3、平铺面包片，上面依次放上生菜、金枪鱼酱、西红柿片、生菜。 \n4、最后盖上另一片面包片，如图对切成三角形即可。',
  salad: 2
}, {
  wich_name: '火腿三明治',
  desc: '1、生菜叶洗净沥干，撕成易食用大小，火腿切成如图大小，煎鸡蛋，准备芝士。\n2、将一片吐司上依次码放生菜，芝士，火腿，煎蛋。\n3、再码放上一片吐司片，轻压一下即可享用。',
  salad: 2
}, {
  wich_name: '坚果三明治',
  desc: '1、将一片吐司上放上坚果，然后再挤入适量沙拉酱。\n2、再码放上一片吐司片，轻压一下即可享用。',
  salad: 2
}, {
  wich_name: '蔬菜三明治',
  desc: '1、西红柿，黄瓜切片，生菜撕碎。\n2.、将一片吐司上依次码放生菜，西红柿片，黄瓜，然后再挤入适量沙拉酱。\n3、再码放上一片吐司片，轻压一下即可享用。',
  salad: 2
}, {
  wich_name: '鸡肉三明治',
  desc: '1、生菜叶洗净沥干，撕成易食用大小，煮鸡蛋切成如图形状，鸡肉煎脆，黄瓜切片。\n2、切片面包放到烤面包机中轻烤。\n3、将食材如图所示摆放，即可使用。',
  salad: 2
}, {
  wich_name: '培根牛油果三明治',
  desc: '1、将面包片均匀涂抹少量丘比沙拉酱黑胡椒味，蔬菜洗净沥干，西红柿切圆形薄片备用。 \n2、培根小火双面煎备用。 \n3、平铺面包片，上面依次放上生菜、培根、牛油果、西红柿片、生菜。 \n4、最后盖上另一片面包片即可。',
  salad: 1
}, {
  wich_name: '金枪鱼甜玉米三明治',
  desc: '1、将面包片均匀涂抹少量丘比沙拉酱香甜味，蔬菜洗净沥干，西红柿切圆形薄片备用。 \n2、金枪鱼开罐、沥干、拌入丘比沙拉酱香甜味，做成金枪鱼酱备用。 \n3、平铺面包片，上面依次放上生菜、金枪鱼酱、西红柿片、生菜。 \n4、最后盖上另一片面包片，如图对切成三角形即可。',
  salad: 1
}, {
  wich_name: '秋游便当三明治',
  desc: '1、西红柿切片，生菜撕碎，培根肉煎脆。\n2、面包片去边切半，将步骤1食材平铺于面包上。\n3、挤上适量丘比沙拉酱香甜味，装入便当盒摆好即可。',
  salad: 3
}, {
  wich_name: '黑胡椒鸡蛋三明治',
  desc: '1、生菜叶洗净沥干，撕成易食用大小。煮鸡蛋切成如图形状。\n2、切片面包放到烤面包机中轻烤。\n3、将食材如图所示摆放，挤上丘比沙拉酱黑胡椒口味抹匀，切成适当大小即可使用。',
  salad: 4
}, {
  wich_name: '金枪鱼三明治',
  desc: '1、将面包片均匀涂抹少量丘比沙拉酱香甜味，蔬菜洗净沥干，西红柿切圆形薄片备用。 \n2、金枪鱼开罐、沥干、拌入丘比沙拉酱香甜味，做成金枪鱼酱备用。 \n3、平铺面包片，上面依次放上生菜、金枪鱼酱、西红柿片、生菜。 \n4、最后盖上另一片面包片，如图对切成三角形即可。',
  salad: 3
}]

export default {
  sandwichImgs
}
