export const cookMenus = [
  {
    title: '樱桃萝卜黑鱼子吐司',
    cookSteps:
      [
        '吐司去边摸上橄榄油切小块，放入预热至200度的烤箱，烤三分钟，樱桃萝卜切薄片。',
        '在吐司块上放上樱桃萝卜片，黑鱼子和欧芹即可。'
      ]
  },
  {
    title: '金枪鱼奶酪树莓吐司',
    cookSteps:
      [
        '金枪鱼罐头剁碎，挤入柠檬汁，拌入里科塔奶酪、黑胡椒，搅拌均匀。',
        '吐司抹上橄榄油，放入预热至200度的烤箱，烤3分钟。',
        '烤好的高纤维全麦吐司抹上金枪鱼奶酪酱，撒上树莓、粉红胡椒。',
      ]
  },
  {
    title: '胡萝卜紫甘蓝沙司酱吐司',
    cookSteps:
      [
        '胡萝卜、紫甘蓝、法葱洗净切丝。',
        '橄榄油、盐、苹果醋加入切成丝的蔬菜中搅拌均匀。',
        '将高纤维全麦吐司放入预热好的160℃烤箱烤5分钟，取出后放入拌好的蔬菜丝即可。',
      ]
  },
  {
    title: '特朗尼黑醋酱抱子甘蓝',
    cookSteps:
      [
        '抱子甘蓝去根撕开，洗净，沥干水分，加盐、黑胡椒、橄榄油。',
        '加工好的抱子甘蓝放在吐司上烤放180℃烤箱烤5分钟。',
        '烤好的高纤维全麦吐司上淋特朗尼黑醋酱。',
      ]
  },
  {
    title: '鲜虾牛油果班尼迪克蛋',
    cookSteps:
      [
        '锅中水煮沸，打入鸡蛋，依次煮两个水波蛋，之后再把虾仁煮熟。',
        '将全麦麦芬横向一剖为二，牛油果切片。',
        '逐层在全麦麦芬上摆置牛油果、虾仁和一颗水波蛋，一勺荷兰汁倒在上方。',
        '烤箱250°C预热，烤制3分钟。',
      ]
  }
]

export const checkInKnowledge=[
  {
    title:'全麦知识',
    text:'全麦谷粒主要分为三层，包括最外层的糠，及内层的胚芽和内胚子。'
  },
  {
    title:'全麦知识',
    text:'全麦食品中富含人体所需的多种维生素、矿物质、纤维素等，人在经过一夜的营养消耗后，体内所缺的维生素、矿物质能在早餐时得到及时补充，对健康非常有好处。'
  },
  {
    title:'全麦知识',
    text:'早餐时若能及时吃点有助于软化血管、降低胆固醇的食物，如燕麦片、全麦面包等，血管硬化的状况会较快得到改善。'
  },
  {
    title:'全麦知识',
    text:'超市里可以买到的燕麦、大麦、糙米、全麦面包、全麦饼干等都属于全麦食品。早餐可以选择燕麦片、全麦面包和牛奶、水果一起食用，体内胆固醇指数正常的人还可加个鸡蛋，但粗粮所占比例最好不要超过1/4。'
  },
  {
    title:'全麦知识',
    text:'精制五谷类只有内层，可提供碳水化合物和少量蛋白质，但纤维和其它营养素并不如全麦谷类。'
  },
  {
    title:'全麦知识',
    text:'小麦畅通肠胃，大部份面包都是使用由小麦制成的面粉，作为主要材料；而麦包用的是全麦面粉，因此纤维素比白面包高。'
  },
  {
    title:'全麦知识',
    text:'燕麦被公认为有效降胆固醇的食物，因为燕麦含「水溶性纤维」，在小肠内与胆汁盐结合，并排出体外；由于胆汁盐含胆固醇，血液内的胆固醇被使用再造胆汁盐，间接收到降胆固醇的效果。'
  },
  {
    title:'全麦知识',
    text:'全麦面包是指用没有去掉外面麸皮和麦胚的全麦面粉制作的面包，其特点是颜色微褐，肉眼能看到很多麦麸的小粒，质地比较粗糙，含有丰富粗纤维、维生素E以及锌、钾等矿物质。'
  },
  {
    title:'全麦知识',
    text:'吸烟会阻碍人体对维生素C的吸收，尼古丁对维生素C有破坏作用，因此吸烟的人容易缺乏维生素C。'
  },
  {
    title:'全麦知识',
    text:'小快步姿势行走最佳，可增加肌肉活动次数，使腿部肌肉强健，增加血液循环。'
  },
  {
    title:'全麦知识',
    text:'筷子用久了会残留细菌和清洁剂，平时除了要对筷子勤消毒外，最好 半年更换一次。'
  },
  {
    title:'全麦知识',
    text:'饭后百步走，活到九十九并不科学，饭后轻微运动也会增加胃肠负担，休息30分钟再活动较为适宜。'
  },
  {
    title:'全麦知识',
    text:'减肥的最好方式就是迈开腿管住嘴。'
  },
  {
    title:'全麦知识',
    text:'用餐节奏不宜过快，细嚼慢咽，让食物和唾液充分混合，让唾液里的酶充分降解，发挥唾液的抗癌功效。'
  },
  {
    title:'全麦知识',
    text:'吃全麦面包，馒头，苏打饼干能提高情绪，抗忧郁，因为 这类事夫含有丰富的维生素和矿物质。'
  },
  {
    title:'全麦知识',
    text:'GI =（Glycemic Index）“血糖生成指数”——是反映食物引起人体血糖升高程度的指标，是人体进食后机体血糖生成的应答状况。GI越高，糖分消化吸收的速度就越快。全麦食品就属于低GI食物。'
  },
  {
    title:'全麦知识',
    text:'世界卫生组织对影响健康的因素进行过如下总结：健康 = 60%生活方式 + 15%遗传因素 + 10%社会因素 + 8%医疗因素 + 7%气候因素，由此可见健康的生活方式管理是新兴起的个人健康管理中最重要的一个策略。'
  },
  {
    title:'全麦知识',
    text:'傍晚锻炼最为有益，原因是：人类的体力发挥或身体的适应能力，都以下午或接近黄昏时分为最佳。此时，人的味觉、视觉、听觉等感觉最敏感，全身协调能力最强，尤其是心率与血压都较平稳，最适宜锻炼。'
  },
  {
    title:'全麦知识',
    text:'现在很多人因为工作忙或者爱睡懒觉而不吃早餐，这对身体是很不健康的。严重影响胃肠功能，长期的话得胃病的几率会很高。所以一顿营养的早餐是每个人不可缺少的，早餐是动力的源泉。'
  },
  {
    title:'全麦知识',
    text:'很多人都喜欢运动，但都是只有在空闲的时候或者突然有兴趣时才会运动。其实一个人每天运动是不可缺少的，至少要运动30分钟，如慢跑，健身，打球等。促进血液循环，排出体内毒素。所以说健康来自运动。'
  }
]




export const answers = [
  {
    answerTitle:'什么是“全麦”？',
    questions:[
      '用没有去掉麸皮的麦类所制的食材',
      '一种大米的名称'
    ],
    rightIndex:0
  },
  {
    answerTitle:'以下哪种食物是全麦食品？',
    questions:[
      '燕麦片',
      '牛奶'
    ],
    rightIndex:0
  },
  {
    answerTitle:'以下哪种有助于减肥？',
    questions:[
      '管住嘴迈开腿',
      '转发锦鲤'
    ],
    rightIndex:0
  },
  {
    answerTitle:'以下哪种是全麦面包的优点？',
    questions:[
      '富含膳食纤维',
      '富含脂肪'
    ],
    rightIndex:0
  },
  {
    answerTitle:'GI值是什么意思？',
    questions:[
      '食物血糖生成指数',
      '空气质量指数'
    ],
    rightIndex:0
  },
  {
    answerTitle:'以下哪种食物是全麦食品？',
    questions:[
      '曼可顿全麦面包',
      '锅包肉'
    ],
    rightIndex:0
  },
  {
    answerTitle:'以下哪种GI值\n(食物血糖生成指数) 低？',
    questions:[
      '白面包',
      '全麦面包'
    ],
    rightIndex:1
  },
  {
    answerTitle:'GI (血糖生成指数)\n越高代表什么？',
    questions:[
      '糖分消化吸收的速度就越快',
      '糖分消化吸收的速度就越慢'
    ],
    rightIndex:1
  },
  {
    //todo 是否错误
    answerTitle:'以下哪项不是鉴别\n全麦面包的方法？',
    questions:[
      '也是微褐，肉眼能看到麦麸的小粒',
      '长得好看'
    ],
    rightIndex:1
  },
  {
    answerTitle:'以下哪种是健康的生活方式？',
    questions:[
      '合理膳食',
      '烟酒不离'
    ],
    rightIndex:0
  },
]


export const howToPlayContent = [
  {
    title:'早起挑战',
    text:'参与活动用户每天可点击早起挑战签到，每天早上6点-9点签到将随机获得10~20麦力值。其他时间签到随机获得1~5麦力值。'
  },
  {
    title:'运动挑战',
    text:'活动期内累计步数可以点亮关卡获得相应的麦力值奖励和勋章。 \n点亮所有关卡领取全麦王勋章将获'
  },
  {
    title:'知识挑战',
    text:'每天点击【知识挑战】可挑战一道问题，答对获得10麦力值，答错不扣分。'
  },
  {
    title:'幸运挑战',
    text:'30麦力值抽奖一次。抽奖消耗的麦力值不影响排行榜历史总麦力值排名。抽奖获得的实物奖品将在xxxx为您发货。'
  },
  {
    title:'麦力值排行榜',
    text:'周排行以每周日24:00为结算时间，每周的周冠军将获得xxxx奖品一份。活动最后的总冠军将获得xxxx奖品一份。'
  },
  {
    title:'麦力值兑奖（4月中上线）',
    text:'麦力值可用于兑换对应麦力值的奖品，奖品限量兑换，兑完截止。抽奖获得的实物奖品将在xxxx为您发货。兑换奖品消耗的麦力值不影响排行榜历史总麦力值排名。'
  },
  {
    title:'活动须知',
    steps:[
      '活动时间： 2019年3月18日-2019年6月9日，实体奖品的留资登记截止时间为2019年6月9日 ',
      '部分地区的互动参与和奖品发放可能受网络环境影响而出现延迟，请保证在畅通的网络环境下参与 互动和进行奖品领取。',
      '互动奖品中的红包涉及微信红包功能，故中奖者需确保使用的是微信最新版本，如中奖者因参与活动时所使用的手机微信版本未达本活动的发奖 要求而出现领奖不成功的情况，主办方将不承担责任。',
      '中奖者需提供主办方要求填写的正确信息，包括 但不限于:姓名、邮箱、地址、手机号等，奖品不支持退换货，如因获奖者不输入或输错联系信息，导致出现奖品错派、 漏派或未能收到官方短信通知的情况，主办方将不承担责任。',
      '活动中奖信息将以曼可顿官方微信的公布为准。用户如因错误关注或将个人信息泄露给其他非曼可顿官方的组织、机构而造成的一切损失，主办方将不承担任何责任。',
      '所涉之相关服务由第三方服务提供商具体提供， 使用服务的相关限制及注意事项以具体服务提供商的要求为准。对于获奖者在领取和使用奖项过程中发生的任何伤害和损失，如该等伤害和损失非由主办方之过错导致，主办方不承担任何责任。',
      '如遇不可抗力无法提供指定奖项，主办方有权以价值相仿的赠品替代公布的奖品。',
      '对于获奖者在领取和使用奖项过程中发生的任何伤害和损失，如该伤害和损失非由主办方之过错导致，主办方不承担任何责任。',
      '如发现用户恶意刷奖行为，包括但不限于:入侵本次活动所使用的网络服务器、使用技术手段获取活动后台信息或篡改活动后台中奖规则、中奖参与记录不符合活动的盗用他人信息参与活动、冒领他人奖品等不正当行为，主办方有杈取消其活动参与杈和收回其所得奖品。',
      '微信搜索“曼可顿”公众号，关注曼可顿官方微信， 实时关注活动最新消息。',
    ]
  },
  {
    tipText:'活动记步数据来源于“微信运动”步数。参与活动用户请开启您的【微信运动步数】授权，“微信运动”步数会被系统记录；为确保运动步数准确性，请务必在比赛当天北京时间24点前进入小程序同步步数，系统将以当天最后一次登录小程序时的微信步数为当天的成绩。'
  }
]



export const baseUrl = 'https://makattan.ysmine.com/'
// export const baseUrl = 'http://47.100.161.51:9080/'
// export const baseUrl = 'http://yunxiaodefen.e1.luyouxia.net:27302/'
